# GetVertex Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TriangulatedShellComponent..::..GetVertex Method
TriangulatedShellComponent Class See Also
---
Returns the vertex with a given index.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public XYZ GetVertex(
	int vertexIndex
)
```

Visual Basic
---
```text
Public Function GetVertex ( _
	vertexIndex As Integer _
) As XYZ
```

Visual C++
---
```text
public:
XYZ^ GetVertex(
	int vertexIndex
)
```

# ### Parameters
vertexIndex
    Type: System..::..Int32 The index of the vertex (between 0 and getVertexCount()-1, inclusive).
# ### Return Value
A copy of the requested vertex.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | vertexIndex is out of range. |

# See Also
TriangulatedShellComponent Class
Autodesk.Revit.DB Namespace